package Code

var AluMap = map[string]string{
	"0":   "0101010",
	"1":   "0111111",
	"-1":  "0111010",
	"D":   "0001100",
	"A":   "0110000", // 当a=0时使用A
	"!D":  "0001101",
	"!A":  "0110001", // 当a=0时使用A
	"-D":  "0001111",
	"-A":  "0110011", // 当a=0时使用A
	"D+1": "0011111",
	"A+1": "0110111", // 当a=0时使用A
	"D-1": "0001110",
	"A-1": "0110010", // 当a=0时使用A
	"D+A": "0000010", // 当a=0时使用A
	"D-A": "0010011", // 当a=0时使用A
	"A-D": "0000111", // 当a=0时使用A
	"D&A": "0000000", // 当a=0时使用A
	"D|A": "0010101", // 当a=0时使用A
	"M":   "1110000", // 当a=1时使用M
	"!M":  "1110001", // 当a=1时使用M
	"-M":  "1110011", // 当a=1时使用M
	"M+1": "1110111", // 当a=1时使用M
	"M-1": "1110010", // 当a=1时使用M
	"D+M": "1000010", // 当a=1时使用M
	"D-M": "1010011", // 当a=1时使用M
	"M-D": "1000111", // 当a=1时使用M
	"D&M": "1000000", // 当a=1时使用M
	"D|M": "1010101", // 当a=1时使用M
}

var JumpMap = map[string]string{
	"":    "000", // 不执行跳转
	"JGT": "001", // 如果大于0则跳转
	"JEQ": "010", // 如果等于0则跳转
	"JGE": "011", // 如果大于等于0则跳转
	"JLT": "100", // 如果小于0则跳转
	"JNE": "101", // 如果不等于0则跳转
	"JLE": "110", // 如果小于等于0则跳转
	"JMP": "111", // 无条件跳转
}

var DestMap = map[string]string{
	"":    "000", // 不存储结果
	"M":   "001", // 存储到内存地址A
	"D":   "010", // 存储到D寄存器
	"MD":  "011", // 存储到内存地址A和D寄存器
	"A":   "100", // 存储到A寄存器
	"AM":  "101", // 存储到A寄存器和内存地址A
	"AD":  "110", // 存储到A寄存器和D寄存器
	"AMD": "111", // 存储到A寄存器、内存地址A和D寄存器
}
